'use strict';

let admin = '';
let name = '';
name = 'Василий';
admin = name;
document.getElementById('admin_name').innerHTML = admin;

//3. *Чему будет равно JS-выражение 1000 + "108"
//
//Ответ: 1000 + "108" = "1000108"

//4. *Самостоятельно разобраться с атрибутами тега script (async и defer)
//
//Ответ: async поддерживается всеми браузерами, кроме IE9 и более ранних.
//defer поддерживается любыми баузерами.
//И async, и defer позволяют загрузить страницу, не ожидая загрузки скрипта (асинхронно),
//но есть 2 отличия:
//defer гарантирует соблюдение порядка исполнения скриптов
//defer сработает только после того, как HTML будет обработан браузером.